app/Listeners/SendOrderConfirmationEmail.php

select * from `users` where `users`.`id` = 1 limit 1
---
    public function handle(OrderPlaced $event): void
    {
//        Mail::to($event->order->user->email)->send(new OrderConfirmationMail($event->order));
        Mail::to($event->order->user->email)->queue(new OrderConfirmationMail($event->order));