app/Http/Controllers/Frontend/CartController.php

    public function add(Product $product)
    {
        DB::transaction(function () use ($product) {

            $cart = $this->getOrCreateCart();

            $existingItem = $cart->items()->where('product_id', $product->id)->first();

            if ($existingItem) {

                $existingItem->increment('quantity');

            } else {

                CartItem::create(
                    [
                        'cart_id' => $cart->id,
                        'product_id' => $product->id,
                        'quantity' => 1,
                        'price' => $product->price
                    ]);
---
select * from `cart_items` where `cart_items`.`cart_id` = 2 and `cart_items`.`cart_id` is not null and `product_id` = 1 limit 1
update `cart_items` set `quantity` = 2, `cart_items`.`updated_at` = '2025-05-20 07:22:39' where `id` = 1
insert into `cart_items` (`cart_id`, `product_id`, `quantity`, `price`, `updated_at`, `created_at`) values (2, 1, 1, '205406.00', '2025-05-20 07:15:29', '2025-05-20 07:15:29')

    protected function getUserActiveCart($withRelations = true)
    {
        $cart = Cart::where('user_id', auth()->id())->where('is_active', true);

        if ($withRelations) {

            $cart->with(
                [
                    'items.product' => function ($query) {
                        $query->select('id', 'name', 'slug', 'price');
                    },
                    'items.product.primaryImage',
                ]);

        }

        $cart = $cart->first();
---
select * from `carts` where `user_id` = 1 and `is_active` = 1 limit 1

    protected function getOrCreateCart()
    {
        return Cart::firstOrCreate(
            ['user_id' => auth()->id(), 'is_active' => true]
        );
---
insert into `carts` (`user_id`, `is_active`, `updated_at`, `created_at`) values (1, 1, '2025-05-20 07:15:29', '2025-05-20 07:15:29')
select * from `carts` where (`user_id` = 1 and `is_active` = 1) limit 1

    protected function calculateCartTotal(Cart $cart)
    {
        return $cart->items->sum(fn ($item) => $item->quantity * $item->price);
---
select * from `cart_items` where `cart_items`.`cart_id` in (3)