app/Http/Controllers/Frontend/OrderController.php

    public function checkout(Request $request)
    {
        $request->validate(
            [
                'shippingMethod' => 'required|exists:shipping_methods,id',
            ]);

        $shippingMethod = ShippingMethod::findOrFail($request->shippingMethod);

        try {

            $order = DB::transaction(function () use ($request, $shippingMethod) {

                // Create order
                $order = Order::create(
                    [
                        'order_number' => Order::generateOrderNumber(),
                        'shipping_amount' => $shippingMethod->base_price,
                        'user_id' => $request->cart->user_id,
                        'shipping_method_id' => $shippingMethod->id,
                        'total_price' => $request->cart->items->sum(fn ($item) => $item->quantity * $item->price) + $shippingMethod->base_price,
                        'status' => 'pending',
                    ]);

                // Prepare order items
                $orderItems = $request->cart->items->map(function ($item) use ($order) {

                    return [
                        'order_id' => $order->id,
                        'product_id' => $item->product_id,
                        'quantity' => $item->quantity,
                        'price' => $item->price,
---
select * from `shipping_methods` where `shipping_methods`.`id` = '1' limit 1
select * from `orders` where (`user_id` = 1 and `status` = 'pending') limit 1
insert into `orders` (`user_id`, `status`, `order_number`, `shipping_amount`, `shipping_method_id`, `total_price`, `updated_at`, `created_at`) values (1, 'pending', 'ORD-20250520-1012', '45000.00', 1, 661218, '2025-05-20 07:39:00', '2025-05-20 07:39:00')

                })->toArray();

                // Insert all items at once
                OrderItem::insert($orderItems);

                // Deactivate cart
                $request->cart->update(['is_active' => false]);
---
insert into `order_items` (`created_at`, `order_id`, `price`, `product_id`, `quantity`, `updated_at`) values ('2025-05-20 13:42:38', 1, '205406.00', 1, 1, '2025-05-20 13:42:38')
update `carts` set `is_active` = 0, `carts`.`updated_at` = '2025-05-20 13:42:38' where `id` = 3