app/Http/Controllers/AuthController.php

    public function login(LoginRequest $request)
    {
        $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'akram.khodami@gmail.com' limit 1