app/Models/Order.php

    public static function generateOrderNumber()
    {
        do {
            $number = 'ORD-' . date('Ymd') . '-' . str_pad(rand(0, 9999), 4, '0', STR_PAD_LEFT);
        } while (self::where('order_number', $number)->exists());
---
select exists(select * from `orders` where `order_number` = 'ORD-20250520-1012') as `exists`